Tekla Open API Reference for Tekla Structures 2025
LoftedPlateOperationException Class
 This empty class serves as a base (marker class) for all the exception thrown in lofted plate operations
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.LoftedPlateOperationException
 Tekla.Structures.Model.InvalidCurveCombinationException
 Tekla.Structures.Model.NullRulingException
 Tekla.Structures.Model.SelfIntersectingSurfaceException
 Tekla.Structures.Model.UnknownLoftedPlateErrorException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract class LoftedPlateOperationException : Exception
Public MustInherit Class LoftedPlateOperationException
	Inherits Exception
The LoftedPlateOperationException type exposes the following members.
Constructors
Name | Description
LoftedPlateOperationException
 Constructs an instance of the class
Top
See Also
Reference
Tekla.Structures.Model Namespace